
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	// 29.10 Рождествин Создание реквизита формы Контактное лицо Начало доработки
	Элемент_КонтактноеЛицо = Элементы.Добавить("КонтактноеЛицо_Р2",Тип("ПолеФормы"),Элементы.ГруппаШапкаПраво);
	Элемент_КонтактноеЛицо.ПутьКДанным =  "Объект.КонтактноеЛицо_Р2";
	Элемент_КонтактноеЛицо.Вид =ВидПоляФормы.ПолеВвода;
	Элемент_КонтактноеЛицо.Заголовок = "Контактное Лицо"; 
	 // 29.10. Рождествин Создание на форме элементов Конец доработки
	 // 29.10 Рождествин Создание реквизита формы Согласованная скидка и команды пересчитать таблицу Начало доработки
	ГруппаПересчета = элементы.Вставить("ГруппаШапкаПересчет", Тип("ГруппаФормы"), Элементы.ГруппаШапкаЛево);  
	ГруппаПересчета.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Элемент_СогласованнаяСкидка = Элементы.Вставить ("СогласованнаяСкидка_Р2", Тип("ПолеФормы"), Элементы.ГруппаШапкаПересчет);
	Элемент_СогласованнаяСкидка.ПутьКДанным = "Объект.СогласованнаяСкидка_Р2";
	Элемент_СогласованнаяСкидка.Вид =ВидПоляФормы.ПолеВвода;
	Элемент_СогласованнаяСкидка.Заголовок = "Согласованная скидка"; 
	Элемент_СогласованнаяСкидка.УстановитьДействие("ПриИзменении","ПриИзмененииСогласованнойСкидки");
	
	Команда = Команды.Добавить("ПересчитатьТаблицу");
	Команда.Заголовок = "Пересчитать Таблицу";
	Команда.Действие = "КомандаПересчитатьТаблицу";
	Элемент_КомандаПересчитатьТаблицу = Элементы.Вставить("ПересчитатьТаблицу", Тип("КнопкаФормы"),Элементы.ГруппаШапкаПересчет);
	Элемент_КомандаПересчитатьТаблицу.ИмяКоманды ="ПересчитатьТаблицу";
	Элемент_КомандаПересчитатьТаблицу.Вид =ВидКнопкиФормы.ОбычнаяКнопка;
	 // 29.10. Рождествин Создание на форме элементов Конец доработки
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПриИзмененииСогласованнойСкидки(Элемент)  
	// 29.10. Рождествин Расчет суммы при изменении скидки, с проверкой условия заполнения таблицы Начало доработки
	
	Если ЗначениеЗаполнено(Объект.Товары) или ЗначениеЗаполнено(Объект.Услуги) Тогда
		Вопрос = ВопросАсинх("Размер скидки изменен. Пересчитать табличные части?",РежимДиалогаВопрос.ДаНет);  
		Ответ = Ждать Вопрос;
		Если Ответ = КодВозвратаДиалога.Да Тогда 
			РассчитатьВсеСтрокиОбеихТаблиц();
		КонецЕсли;
	КонецЕсли;
	// 29.10. Рождествин Конец доработки
	
КонецПроцедуры 


&НаКлиенте
Процедура КомандаПересчитатьТаблицу (Команда)
	// 29.10. Рождествин Команда пересчитать обе таблицы с  учетом скидки  Начало доработки
	РассчитатьВсеСтрокиОбеихТаблиц();   
	// 29.10. Рождествин  Конец доработки
	
КонецПроцедуры 

#КонецОбласти



#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	// 29.10. Рождествин Изменение расчета суммы по строке с применением скидки Начало доработки
	//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	РассчитатьСуммуСтрокиФрагмент(ТекущиеДанные);
	
	// 29.10. Рождествин  Конец доработки
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
&НаКлиенте
Процедура РассчитатьСуммуСтрокиФрагмент(ТекущиеДанные)
	// 29.10. Рождествин Изменение формулы расчета суммы по строке, применение скидки в строке и согласованной скидки с проверкой суммарной скидки Начало доработки
	Если Объект.СогласованнаяСкидка_Р2 + ТекущиеДанные.Скидка < 100 Тогда
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена *(100 - Объект.СогласованнаяСкидка_Р2-ТекущиеДанные.Скидка)/100;
Иначе
	
	 Сообщение = новый СообщениеПользователю();
	 Сообщение.Текст ="Суммарная скидка больше 100%";
	 Сообщение.Сообщить();
	 ТекущиеДанные.Сумма = 0;
	 КонецЕсли;
	// 29.10. Рождествин Изменение формулы расчета суммы по строке, применение скидки Конец доработки
КонецПроцедуры   

&НаКлиенте
Процедура РассчитатьВсеСтрокиОбеихТаблиц()
	// 29.10. Рождествин, добавленная, пересчет таблиц   Начало доработки
	Для Каждого СтрокаТовары из Объект.Товары цикл
		РассчитатьСуммуСтрокиФрагмент(СтрокаТовары);
	КонецЦикла;
	
	Для Каждого СтрокаУслуги из Объект.Услуги цикл   
		РассчитатьСуммуСтрокиФрагмент(СтрокаУслуги);
	КонецЦикла; 
	РассчитатьСуммуДокумента();
	// 29.10. Рождествин, добавленная, пересчет таблиц   Конец доработки
	
Конецпроцедуры

#КонецОбласти
