#Область ОбработчикиСобытий
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	// 29.10. Рождествин, добавленная, Задействованые поля для представления Начало
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОсновании");
	СтандартнаяОбработка =Ложь;
	// 29.10 Рождествин Задействованые поля для представления Конец
	
КонецПроцедуры


Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	// 29.10. Рождествин Добавленная, Представление в зависимости от заполнения поля ДействуетНаОсновани Начало
	Если ЗначениеЗаполнено(Данные.ДействуетНаОсновании) Тогда
		СтандартнаяОбработка = Ложь;
		Представление = Строка(Данные.Наименование) + " (Действует на основании " + СокрЛП(Данные.ДействуетНаОсновании) + ")";
	Иначе  Представление = Строка(Данные.Наименование);
	КонецЕсли;
	// 29.10 Рождествин Представление в зависимости от заполнения поля ДействуетНаОсновани Конец
КонецПроцедуры
#Конецобласти